target/test-classes/xml/ows/CreditAgreementIframe/TC34669_createOrderRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <ord1:createOrder correlationId="" type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <account type="RESIDENTIAL">
        <contact type="BILLING" language="en_GB">
          <title>Mr</title>
          <firstName>gorden</firstName>
          <lastName>STACKER</lastName>
          <telephoneNumbers defaultContact="daytime">
            <daytime>0398403850</daytime>
            <evening>0208619999</evening>
            <mobile>02086999990</mobile>
          </telephoneNumbers>
          <emailAddress>gorden.sun@hsntech.com</emailAddress>
          <birthDate>1975-01-01</birthDate>
        </contact>
        <billingAddress>
          <buildingIdentifier>3</buildingIdentifier>
          <addressLine1>DALTON WAY</addressLine1>
          <addressLine2>MANSFIELD PARK</addressLine2>
          <town>ELY</town>
          <country>United Kingdom</country>
          <postcode>CB61DS</postcode>
          <ptc_abs_code>PTCABS31116177</ptc_abs_code>
          <startDate>1980-08-08</startDate>
        </billingAddress>
        <accountDetail>
          <username>${#TestCase#emailAddress}</username>
          <password>Password04</password>
          <securityQuestion>Mothers maiden name?</securityQuestion>
          <securityAnswer>smith</securityAnswer>
        </accountDetail>
        <billingDetail>
          <billGroupId>422</billGroupId>
          <preferredNotification>SMS</preferredNotification>
          <paymentDetail type="CARD">
            <creditCard>
              <cardName>Card</cardName>
              <cardNumber>4012001036273346</cardNumber>
              <cardType>VI</cardType>
              <cardExpiryDate>1222</cardExpiryDate>
              <cvv>123</cvv>
            </creditCard>
          </paymentDetail>
          <billFormat>SUMMARY</billFormat>
          <clubcardNumber>634143330730912784</clubcardNumber>
        </billingDetail>
      </account>
      <verification runCreditCheck="true" termsAndConditionsAccepted="false" refundableDepositAccepted="false" acceptAgreement="false">
        <interconnect>
          <param name="PAYASYOUGO">078940302030</param>
        </interconnect>
      </verification>
      <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
        <dateTime>2011-06-10T16:44:31.0Z</dateTime>
        <orderItem id="1" dealSKU="DEAL-100" masterSubscription="false">
          <serviceRef reference="Mobile 1"/>
          <tariff productCode="FC12-1000-500SO">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="HTC-DESIRE-XXX-99">
            <deliveryMethod>DELIVER</deliveryMethod>
            <imei>359090017074582</imei>
            <serialNumber>123152436457568486784684</serialNumber>
            <agreement provider="AGRTESCOMOBILE">
              <number>AGR12343256546745754778</number>
            </agreement>
          </device>
          <discBundle productCode="00750-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <insurance productCode="MA">
            <deliveryMethod>INHAND</deliveryMethod>
          </insurance>
        </orderItem>
        <!--Remove BC-->
        <!--<orderItem id="2" dealSKU="DEAL-100" masterSubscription="false">
               <serviceRef reference="Mobile 2"/>
               <tariff productCode="BC12-2000-1250SO-1G">
                  <deliveryMethod>INHAND</deliveryMethod>
               </tariff>
               <device productCode="HTC-DESIRE-XXX-99">
                  <deliveryMethod>DELIVER</deliveryMethod>
                  <imei>359090017074582</imei>
                  <serialNumber>123152436457568486784686</serialNumber>
                  <agreement provider="AGRTESCOMOBILE">
                  	<number>AGR12343256546745456778</number>
                  </agreement>
               </device>
               <insurance productCode="MA">
                  <deliveryMethod>INHAND</deliveryMethod>
               </insurance>
            </orderItem>-->
        <orderItem id="3" dealSKU="DEAL-100" masterSubscription="false">
          <serviceRef reference="Mobile 3"/>
          <tariff productCode="FC12-1000-500SO">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="HTC-DESIRE-XXX-99">
            <deliveryMethod>DELIVER</deliveryMethod>
            <imei>359090017074582</imei>
            <serialNumber>123152436457568486784688</serialNumber>
            <agreement provider="AGRTESCOMOBILE">
              <number>AGR12343256546745754458</number>
            </agreement>
          </device>
          <discBundle productCode="00750-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <insurance productCode="MA">
            <deliveryMethod>INHAND</deliveryMethod>
          </insurance>
        </orderItem>
        <orderItem id="4" dealSKU="DEAL-100" masterSubscription="false">
          <serviceRef reference="Mobile 4"/>
          <tariff productCode="NC1-1000-250">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="HTC-DESIRE-XXX-99">
            <deliveryMethod>DELIVER</deliveryMethod>
            <imei>359090017074582</imei>
            <serialNumber>123152436457568486784484</serialNumber>
            <agreement provider="AGRTESCOMOBILE">
              <number>AGR13443256546745754778</number>
            </agreement>

          </device>
          <discBundle bundleGroup="STANDARDDATACAPPED" productCode="1GB-DATA-750-NC">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <insurance productCode="MA">
            <deliveryMethod>INHAND</deliveryMethod>
          </insurance>
        </orderItem>
        <orderItem id="5" dealSKU="DEAL-100" masterSubscription="false">
          <serviceRef reference="Mobile 5"/>
          <tariff productCode="NC1-1000-250">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="HTC-DESIRE-XXX-99">
            <deliveryMethod>DELIVER</deliveryMethod>
            <imei>359090017074582</imei>
            <serialNumber>123152436457568486764484</serialNumber>
            <agreement provider="AGRTESCOMOBILE">
              <number>AGR123432565467123455778</number>
            </agreement>

          </device>
          <discBundle bundleGroup="STANDARDDATACAPPED" productCode="1GB-DATA-750-NC">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <insurance productCode="MA">
            <deliveryMethod>INHAND</deliveryMethod>
          </insurance>
        </orderItem>
        <orderEvent dateTime="2013-06-10T16:41:30.0Z" eventType="Initiated Order">Started Order</orderEvent>
        <paymentRequest>
          <cardName>Card</cardName>
          <cardNumber>4012001036273346</cardNumber>
          <cardType>VI</cardType>
          <cardExpiryDate>1222</cardExpiryDate>
          <cvv>123</cvv>
        </paymentRequest>
      </orderDetail>
    </ord1:createOrder>
  </soapenv:Body>
</soapenv:Envelope>